In [31]:
import pandas as pd

In [32]:
df=pd.read_csv(r"C:\Banking_project\loans.csv")

In [33]:
df

,loan_id,customer_id,loan_type,loan_amount,interest_rate,tenure_months,start_date,end_date,status
0,1,3199,Business,3735788.21,6.88,24,2025-06-20,2027-06-20,Defaulted
1,2,2777,Business,1135511.65,12.15,48,2025-07-06,2029-07-06,Closed
2,3,3451,Education,3924125.24,10.14,120,2022-09-02,2032-09-02,Closed
3,4,1084,Car,3505467.98,9.60,84,2023-08-07,2030-08-07,Active
4,5,2677,Home,841570.56,9.69,84,2023-12-22,2030-12-22,Closed
...,...,...,...,...,...,...,...,...,...
1995,1996,3808,Home,4861642.38,9.39,12,2023-02-28,2024-02-28,Closed
1996,1997,1376,Home,2000959.55,8.11,36,2024-04-14,2027-04-14,Active
1997,1998,1651,Business,399144.76,12.68,84,2024-06-17,2031-06-17,Defaulted
1998,1999,3080,Home,1285921.27,11.37,12,2022-11-15,2023-11-15,Defaulted
1999,2000,1604,Education,3454476.53,10.27,60,2023-04-21,2028-04-21,Closed

In [34]:
df.head()

,loan_id,customer_id,loan_type,loan_amount,interest_rate,tenure_months,start_date,end_date,status
0,1,3199,Business,3735788.21,6.88,24,2025-06-20,2027-06-20,Defaulted
1,2,2777,Business,1135511.65,12.15,48,2025-07-06,2029-07-06,Closed
2,3,3451,Education,3924125.24,10.14,120,2022-09-02,2032-09-02,Closed
3,4,1084,Car,3505467.98,9.60,84,2023-08-07,2030-08-07,Active
4,5,2677,Home,841570.56,9.69,84,2023-12-22,2030-12-22,Closed

In [35]:
df.tail()

,loan_id,customer_id,loan_type,loan_amount,interest_rate,tenure_months,start_date,end_date,status
1995,1996,3808,Home,4861642.38,9.39,12,2023-02-28,2024-02-28,Closed
1996,1997,1376,Home,2000959.55,8.11,36,2024-04-14,2027-04-14,Active
1997,1998,1651,Business,399144.76,12.68,84,2024-06-17,2031-06-17,Defaulted
1998,1999,3080,Home,1285921.27,11.37,12,2022-11-15,2023-11-15,Defaulted
1999,2000,1604,Education,3454476.53,10.27,60,2023-04-21,2028-04-21,Closed

In [36]:
df.shape

(2000, 9)

In [37]:
df.columns.to_list

<bound method IndexOpsMixin.tolist of Index(['loan_id', 'customer_id', 'loan_type', 'loan_amount', 'interest_rate',
       'tenure_months', 'start_date', 'end_date', 'status'],
      dtype='object')>

In [38]:
df.isnull().sum()

loan_id          0
customer_id      0
loan_type        0
loan_amount      0
interest_rate    0
tenure_months    0
start_date       0
end_date         0
status           0
dtype: int64

In [39]:
df.dtypes

loan_id            int64
customer_id        int64
loan_type         object
loan_amount      float64
interest_rate    float64
tenure_months      int64
start_date        object
end_date          object
status            object
dtype: object

In [41]:
df.duplicated().sum()

np.int64(0)

In [ ]:
# Standardize the Text columns

In [43]:
df['loan_type'] = df['loan_type'].str.strip().str.title()
df['status'] = df['status'].str.strip().str.title()

In [44]:
df

,loan_id,customer_id,loan_type,loan_amount,interest_rate,tenure_months,start_date,end_date,status
0,1,3199,Business,3735788.21,6.88,24,2025-06-20,2027-06-20,Defaulted
1,2,2777,Business,1135511.65,12.15,48,2025-07-06,2029-07-06,Closed
2,3,3451,Education,3924125.24,10.14,120,2022-09-02,2032-09-02,Closed
3,4,1084,Car,3505467.98,9.60,84,2023-08-07,2030-08-07,Active
4,5,2677,Home,841570.56,9.69,84,2023-12-22,2030-12-22,Closed
...,...,...,...,...,...,...,...,...,...
1995,1996,3808,Home,4861642.38,9.39,12,2023-02-28,2024-02-28,Closed
1996,1997,1376,Home,2000959.55,8.11,36,2024-04-14,2027-04-14,Active
1997,1998,1651,Business,399144.76,12.68,84,2024-06-17,2031-06-17,Defaulted
1998,1999,3080,Home,1285921.27,11.37,12,2022-11-15,2023-11-15,Defaulted
1999,2000,1604,Education,3454476.53,10.27,60,2023-04-21,2028-04-21,Closed

In [ ]:
# Coverting the Date columns

In [45]:
df['start_date'] = pd.to_datetime(df['start_date'], errors='coerce')
df['end_date'] = pd.to_datetime(df['end_date'], errors='coerce')

In [46]:
df.dtypes

loan_id                   int64
customer_id               int64
loan_type                object
loan_amount             float64
interest_rate           float64
tenure_months             int64
start_date       datetime64[ns]
end_date         datetime64[ns]
status                   object
dtype: object

In [ ]:
# Ensure numeric columns are correct

In [47]:
numeric_cols = ['loan_amount', 'interest_rate', 'tenure_months']
df[numeric_cols] = df[numeric_cols].apply(pd.to_numeric, errors='coerce')

In [49]:
df.dtypes

loan_id                   int64
customer_id               int64
loan_type                object
loan_amount             float64
interest_rate           float64
tenure_months             int64
start_date       datetime64[ns]
end_date         datetime64[ns]
status                   object
dtype: object

In [ ]:
# verify the tenure consistency

In [53]:
df['calculated_tenure'] = ((df['end_date'] - df['start_date']).dt.days / 30).round()
df.loc[abs(df['tenure_months'] - df['calculated_tenure']) > 1, 'tenure_months'] = df['calculated_tenure']
df.drop(columns=['calculated_tenure'], inplace=True)

In [54]:
df

,loan_id,customer_id,loan_type,loan_amount,interest_rate,tenure_months,start_date,end_date,status
0,1,3199,Business,3735788.21,6.88,24,2025-06-20,2027-06-20,Defaulted
1,2,2777,Business,1135511.65,12.15,48,2025-07-06,2029-07-06,Closed
2,3,3451,Education,3924125.24,10.14,122,2022-09-02,2032-09-02,Closed
3,4,1084,Car,3505467.98,9.60,84,2023-08-07,2030-08-07,Active
4,5,2677,Home,841570.56,9.69,84,2023-12-22,2030-12-22,Closed
...,...,...,...,...,...,...,...,...,...
1995,1996,3808,Home,4861642.38,9.39,12,2023-02-28,2024-02-28,Closed
1996,1997,1376,Home,2000959.55,8.11,36,2024-04-14,2027-04-14,Active
1997,1998,1651,Business,399144.76,12.68,84,2024-06-17,2031-06-17,Defaulted
1998,1999,3080,Home,1285921.27,11.37,12,2022-11-15,2023-11-15,Defaulted
1999,2000,1604,Education,3454476.53,10.27,60,2023-04-21,2028-04-21,Closed

In [ ]:
# exporting the cleaned dataset

In [55]:
df.to_csv("C:\Banking_project\cleaned_loans.csv",index=False)